tests/integration/product_dispatch_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postProductDispatch>
      <ns1:ObjectList>
        <ns1:ProductDispatchData>
          <ns1:ProductDispatchModel>
            <ns1:PRODUCT_TYPE>Bike</ns1:PRODUCT_TYPE>
            <ns1:KMS_TO>500</ns1:KMS_TO>
            <ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
            <ns1:VEC_DIS_DT>2014-03-20</ns1:VEC_DIS_DT>
            <ns1:DAYS_LIMIT_FROM>25</ns1:DAYS_LIMIT_FROM>
            <ns1:CHASSIS>XXXXXXXXXX</ns1:CHASSIS>
            <ns1:DAYS_LIMIT_TO>30</ns1:DAYS_LIMIT_TO>
            <ns1:KMS_FROM>400</ns1:KMS_FROM>
            <ns1:SERVICE_TYPE>1</ns1:SERVICE_TYPE>
            <ns1:UCN_NO>USC001</ns1:UCN_NO>
            <ns1:KUNNR>GMDEALER001</ns1:KUNNR>
          </ns1:ProductDispatchModel>
          <ns1:ProductDispatchModel>
            <ns1:PRODUCT_TYPE>Bike</ns1:PRODUCT_TYPE>
            <ns1:KMS_TO>500</ns1:KMS_TO>
            <ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
            <ns1:VEC_DIS_DT>2014-03-20</ns1:VEC_DIS_DT>
            <ns1:DAYS_LIMIT_FROM>25</ns1:DAYS_LIMIT_FROM>
            <ns1:CHASSIS>XXXXXXXXXX</ns1:CHASSIS>
            <ns1:DAYS_LIMIT_TO>30</ns1:DAYS_LIMIT_TO>
            <ns1:KMS_FROM>400</ns1:KMS_FROM>
            <ns1:SERVICE_TYPE>2</ns1:SERVICE_TYPE>
            <ns1:UCN_NO>USC002</ns1:UCN_NO>
            <ns1:KUNNR>GMDEALER001</ns1:KUNNR>
          </ns1:ProductDispatchModel>
        </ns1:ProductDispatchData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>gladminds</ns1:UserName>
        <ns1:Password>gladminds</ns1:Password>
      </ns1:Credential>
    </ns1:postProductDispatch>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>